-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 03 2018 г., 02:48
-- Версия сервера: 5.5.53
-- Версия PHP: 5.6.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `mtstest`
--

-- --------------------------------------------------------

--
-- Структура таблицы `operations`
--

CREATE TABLE `operations` (
  `id` int(7) NOT NULL,
  `senderId` int(7) NOT NULL,
  `receiverId` int(7) NOT NULL,
  `amount` decimal(10,0) NOT NULL,
  `date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `operations`
--

INSERT INTO `operations` (`id`, `senderId`, `receiverId`, `amount`, `date`) VALUES
(200, 4, 3, '1', '2018-05-03 06:21:12'),
(201, 2, 3, '310', '2018-05-03 06:21:12'),
(202, 4, 1, '1', '2018-05-03 06:21:12'),
(203, 4, 3, '1', '2018-05-03 06:21:12'),
(204, 2, 3, '310', '2018-05-03 06:21:12'),
(205, 4, 1, '1', '2018-05-03 06:21:12'),
(206, 4, 3, '1', '2018-05-03 06:21:12'),
(207, 2, 3, '310', '2018-05-03 06:21:13'),
(208, 4, 1, '1', '2018-05-03 06:21:13'),
(209, 4, 3, '1', '2018-05-03 06:21:13'),
(210, 2, 3, '310', '2018-05-03 06:21:14'),
(211, 4, 1, '1', '2018-05-03 06:21:14'),
(212, 4, 3, '1', '2018-05-03 06:21:14'),
(213, 2, 3, '310', '2018-05-03 06:21:15'),
(214, 4, 1, '1', '2018-05-03 06:21:15'),
(215, 4, 3, '1', '2018-05-03 06:21:15'),
(216, 2, 3, '310', '2018-05-03 06:21:15'),
(217, 4, 1, '1', '2018-05-03 06:21:15'),
(218, 4, 3, '1', '2018-05-03 06:21:15'),
(219, 2, 3, '310', '2018-05-03 06:21:15'),
(220, 4, 1, '1', '2018-05-03 06:21:15'),
(221, 4, 3, '1', '2018-05-03 06:21:15'),
(222, 2, 3, '310', '2018-05-03 06:21:16'),
(223, 4, 1, '1', '2018-05-03 06:21:16'),
(224, 4, 3, '1', '2018-05-03 06:21:16'),
(225, 2, 3, '310', '2018-05-03 06:21:16'),
(226, 4, 1, '1', '2018-05-03 06:21:16'),
(227, 4, 3, '1', '2018-05-03 06:21:16'),
(228, 2, 3, '310', '2018-05-03 06:21:16'),
(229, 4, 1, '1', '2018-05-03 06:21:16'),
(230, 4, 3, '1', '2018-05-03 06:21:16'),
(231, 2, 3, '310', '2018-05-03 06:21:17'),
(232, 4, 1, '1', '2018-05-03 06:21:17'),
(233, 4, 3, '1', '2018-05-03 06:21:17'),
(234, 2, 3, '310', '2018-05-03 06:21:17'),
(235, 4, 1, '1', '2018-05-03 06:21:17'),
(236, 4, 3, '1', '2018-05-03 06:21:17'),
(237, 2, 3, '310', '2018-05-03 06:21:18'),
(238, 4, 1, '1', '2018-05-03 06:21:18'),
(240, 2, 3, '310', '2018-05-03 06:21:19'),
(241, 4, 1, '1', '2018-05-03 06:21:19'),
(243, 2, 3, '310', '2018-05-03 06:21:19'),
(244, 4, 1, '1', '2018-05-03 06:21:19'),
(245, 4, 3, '1', '2018-05-03 06:21:19'),
(246, 2, 3, '310', '2018-05-03 06:21:21'),
(247, 4, 1, '1', '2018-05-03 06:21:21'),
(248, 4, 3, '1', '2018-05-03 06:21:21'),
(249, 2, 3, '310', '2018-05-03 06:21:22'),
(250, 4, 1, '1', '2018-05-03 06:21:22'),
(251, 4, 3, '1', '2018-05-03 06:21:22'),
(252, 2, 3, '310', '2018-05-03 06:21:23'),
(253, 4, 1, '1', '2018-05-03 06:21:23'),
(254, 4, 3, '1', '2018-05-03 06:21:23'),
(255, 2, 3, '310', '2018-05-03 06:21:24'),
(256, 4, 1, '1', '2018-05-03 06:21:24'),
(257, 4, 3, '1', '2018-05-03 06:21:24'),
(258, 2, 3, '310', '2018-05-03 06:21:25'),
(259, 4, 1, '1', '2018-05-03 06:21:25'),
(260, 4, 3, '1', '2018-05-03 06:21:25');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(7) NOT NULL,
  `name` varchar(100) NOT NULL,
  `amount` decimal(10,2) NOT NULL DEFAULT '0.00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `amount`) VALUES
(1, 'Anton Komolov', '3851.00'),
(2, 'Nikolay Valuev', '55555.00'),
(3, 'Улубек Улугбеков', '16861.00'),
(4, 'Иосиф Пригожин', '9805.00');

-- --------------------------------------------------------

--
-- Структура таблицы `valute`
--

CREATE TABLE `valute` (
  `ID` varchar(10) NOT NULL,
  `NumCode` int(5) NOT NULL,
  `CharCode` varchar(5) NOT NULL,
  `Nominal` int(5) NOT NULL,
  `Name` varchar(30) NOT NULL,
  `Value` decimal(10,3) NOT NULL,
  `Previous` decimal(10,3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `valute`
--

INSERT INTO `valute` (`ID`, `NumCode`, `CharCode`, `Nominal`, `Name`, `Value`, `Previous`) VALUES
('1', 1, 'RUB', 1, 'Российский рубль', '1.000', '1.000'),
('R01010', 36, 'AUD', 1, 'Австралийский доллар', '47.027', '47.314'),
('R01060', 51, 'AMD', 100, 'Армянских драмов', '12.828', '12.981'),
('R01350', 124, 'CAD', 1, 'Канадский доллар', '48.350', '48.644'),
('R01375', 156, 'CNY', 10, 'Китайских юаней', '97.895', '98.861'),
('R01760', 203, 'CZK', 10, 'Чешских крон', '29.535', '29.736'),
('R01215', 208, 'DKK', 1, 'Датская крона', '10.094', '10.165'),
('R01200', 344, 'HKD', 10, 'Гонконгских долларов', '79.006', '79.922'),
('R01135', 348, 'HUF', 100, 'Венгерских форинтов', '24.045', '24.229'),
('R01270', 356, 'INR', 100, 'Индийских рупий', '93.065', '93.922'),
('R01820', 392, 'JPY', 100, 'Японских иен', '56.857', '57.376'),
('R01335', 398, 'KZT', 100, 'Казахстанских тенге', '18.955', '19.140'),
('R01815', 410, 'KRW', 1000, 'Вон Республики Корея', '58.060', '58.274'),
('R01370', 417, 'KGS', 100, 'Киргизских сомов', '89.935', '91.105'),
('R01500', 498, 'MDL', 10, 'Молдавских леев', '37.417', '37.810'),
('R01535', 578, 'NOK', 10, 'Норвежских крон', '77.893', '78.228'),
('R01625', 702, 'SGD', 1, 'Сингапурский доллар', '46.835', '47.248'),
('R01810', 710, 'ZAR', 10, 'Южноафриканских рэндов', '50.291', '50.632'),
('R01770', 752, 'SEK', 10, 'Шведских крон', '71.604', '71.852'),
('R01775', 756, 'CHF', 1, 'Швейцарский франк', '62.759', '63.264'),
('R01035', 826, 'GBP', 1, 'Фунт стерлингов Соединенного к', '85.485', '87.076'),
('R01235', 840, 'USD', 1, 'Доллар США', '62.000', '62.726'),
('R01717', 860, 'UZS', 10000, 'Узбекских сумов', '76.845', '77.745'),
('R01090B', 933, 'BYN', 1, 'Белорусский рубль', '31.054', '31.199'),
('R01710A', 934, 'TMT', 1, 'Новый туркменский манат', '17.740', '17.947'),
('R01020A', 944, 'AZN', 1, 'Азербайджанский манат', '36.261', '36.865'),
('R01585F', 946, 'RON', 1, 'Румынский лей', '16.133', '16.238'),
('R01700J', 949, 'TRY', 1, 'Турецкая лира', '15.338', '15.457'),
('R01589', 960, 'XDR', 1, 'СДР (специальные права заимств', '89.143', '90.553'),
('R01670', 972, 'TJS', 10, 'Таджикских сомони', '69.744', '70.554'),
('R01100', 975, 'BGN', 1, 'Болгарский лев', '38.447', '38.720'),
('R01239', 978, 'EUR', 1, 'Евро', '75.206', '75.761'),
('R01720', 980, 'UAH', 10, 'Украинских гривен', '23.637', '23.950'),
('R01565', 985, 'PLN', 1, 'Польский злотый', '17.867', '17.916'),
('R01115', 986, 'BRL', 1, 'Бразильский реал', '17.940', '18.048');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `operations`
--
ALTER TABLE `operations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `valute`
--
ALTER TABLE `valute`
  ADD PRIMARY KEY (`NumCode`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `operations`
--
ALTER TABLE `operations`
  MODIFY `id` int(7) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=261;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(7) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
